nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_queued_spi.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.queued_spi"
#endif

/*! @brief Typedef for master interrupt psHandler. */
typedef void (*qspi_master_isr_t)(qspi_master_transfer_handle_t *psHandle);

/*! @brief Typedef for slave interrupt psHandler. */
typedef void (*qspi_slave_isr_t)(qspi_slave_transfer_handle_t *psHandle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Toggle PCS signal.
 * This is not a public API.
 */
static void QSPI_TogglePCS(QSPI_Type *base);

/*!
 * @brief Read data out of the RX FIFO.
 * This is not a public API.
 */
static void QSPI_TransferReadoutRxFifo(QSPI_Type *base, qspi_master_transfer_handle_t *psHandle);

/*!
 * @brief Fill up the TX FIFO with data.
 * This is not a public API.
 */
static void QSPI_TransferFillUpTxFifo(QSPI_Type *base, qspi_master_transfer_handle_t *psHandle);

/*!
 * @brief Master finishes up a transfer.
 * Calls call back if there is a callback function and set the state to idle.
 * This is not a public API.
 */
static void QSPI_MasterTransferComplete(QSPI_Type *base, qspi_master_transfer_handle_t *psHandle);

/*!
 * @brief Slave finishes up a transfer.
 * Calls call back if there is a callback function and set the state to idle.
 * This is not a public API.
 */
static void QSPI_SlaveTransferComplete(QSPI_Type *base, qspi_slave_transfer_handle_t *psHandle);

/*!
 * @brief QUEUEDSPI common interrupt IRQ psHandler.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param param pointer to s_psQspiHandles which stores the transfer state.
 */
static void QSPI_CommonIRQHandler(QSPI_Type *base, void *param);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Pointers to queued_spi bases for each instance. */
static QSPI_Type *const s_psQspiBases[] = QSPI_BASE_PTRS;

/*! @brief Pointers to queued_spi IRQ number for each instance. */
static IRQn_Type const s_eQspiRXIRQs[] = QSPI_RX_IRQS;
static IRQn_Type const s_eQspiTXIRQs[] = QSPI_TX_IRQS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Pointers to queued_spi clocks for each instance. */
static clock_ip_name_t const s_eQspiClocks[] = QSPI_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! @brief Pointers to queued_spi psHandles for each instance. */
static void *s_psQspiHandles[ARRAY_SIZE(s_psQspiBases)];

/*! @brief Pointer to master IRQ psHandler for each instance. */
static qspi_master_isr_t s_pfQspiMasterIsr;

/*! @brief Pointer to slave IRQ psHandler for each instance. */
static qspi_slave_isr_t s_pfQspiSlaveIsr;

/* @brief Dummy data for each instance. This data is used when user's TX buffer is NULL. */
volatile uint8_t s_u8DummyDatas[ARRAY_SIZE(s_psQspiBases)] = {0};
/**********************************************************************************************************************
 * Code
 *********************************************************************************************************************/
/*!
 * brief Get instance number for QUEUEDSPI module.
 *
 * param base QUEUEDSPI peripheral base address.
 */
uint32_t QSPI_GetInstance(QSPI_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0U; instance < ARRAY_SIZE(s_psQspiBases); instance++)
    {
        if (s_psQspiBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_psQspiBases));

    return instance;
}

/*!
 * brief Get dummy data for each instance.
 *
 * param base QUEUEDSPI peripheral base address.
 */
uint8_t QSPI_GetDummyData(QSPI_Type *base)
{
    uint8_t instance = s_u8DummyDatas[QSPI_GetInstance(base)];

    return instance;
}

/*!
 * brief Set up the dummy data.
 *
 * param base QUEUEDSPI peripheral address.
 * param dummyData Data to be transferred when TX buffer is NULL.
 */
void QSPI_SetDummyData(QSPI_Type *base, uint8_t dummyData)
{
    uint32_t instance        = QSPI_GetInstance(base);
    s_u8DummyDatas[instance] = dummyData;
}

/*!
 * @brief Toggle the Slave Select signal for master mode
 */
static void QSPI_TogglePCS(QSPI_Type *base)
{
    if (QSPI_MasterGetSlaveSelectLogicLevel(base) == kQSPI_SlaveSelectLogicHigh)
    {
        QSPI_MasterSetSlaveSelectLogicLevel(base, kQSPI_SlaveSelectLogicLow);
    }
    else
    {
        QSPI_MasterSetSlaveSelectLogicLevel(base, kQSPI_SlaveSelectLogicHigh);
    }
}

/*!
 * brief Initializes the QUEUEDSPI master.
 *
 * param base QUEUEDSPI peripheral address.
 * param psConfig Pointer to the structure qspi_master_config_t.
 * param u32SrcClockHz Module source input clock in Hertz.
 */
void QSPI_MasterInit(QSPI_Type *base, const qspi_master_config_t *psConfig)
{
    assert(NULL != psConfig);

    uint16_t temp;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable queued_spi clock */
    CLOCK_EnableClock(s_eQspiClocks[QSPI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Disable module before configuring. */
    QSPI_Enable(base, false);

    /* Set module as master. */
    QSPI_SetMasterSlaveMode(base, kQSPI_Master);

    /* Set CPHA, CPOL and date shift order. */
    QSPI_SetClockPolarity(base, psConfig->eClkPolarity);
    QSPI_SetClockPhase(base, psConfig->eClkPhase);
    QSPI_SetDataShiftOrder(base, psConfig->eShiftDirection);
    QSPI_EnableModeFault(base, psConfig->bEnableModeFault);

    /* Calculate baudrate devider. */
    if (0U == QSPI_MasterSetBaudRate(base, psConfig->u32BaudRateBps, psConfig->u32ClockFrequencyHz))
    {
        assert(false);
    }

    /* Set wired-or mode, PCS polarity and data width. */
    QSPI_EnableWiredORMode(base, psConfig->bEnableWiredOrMode);
    QSPI_EnableDMA(base, psConfig->u8DmaEnableFlags);

    /* Slave Select Signal Configuration */
    QSPI_MasterEnableSlaveSelectOpenDrainMode(base, psConfig->bEnableSlaveSelOpenDrain);

    /* Do not Enable auto Slave Select if mode default is enabled */
    if (psConfig->bEnableModeFault && psConfig->bEnableSlaveSelAutoMode)
    {
        /* Automatic mode shall not be used when Mode Fault detect is enabled. */
        assert(false);
    }
    else
    {
        QSPI_MasterEnableSlaveSelectAutomaticMode(base, psConfig->bEnableSlaveSelAutoMode);
    }

