nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.c
    /* Configure the Slave Select direction according to mode fault */
    if (psConfig->bEnableModeFault)
    {
        QSPI_SetSlaveSelectDirection(base, kQSPI_SlaveSelectDirectionInput);
    }
    else
    {
        QSPI_SetSlaveSelectDirection(base, kQSPI_SlaveSelectDIrectionOutput);
    }

    /* Do not Enable strobe if mode default is enabled */
    if (psConfig->bEnableModeFault && psConfig->bEnableStrobe)
    {
        /* Strobe mode shall not be used when Mode Fault detect is enabled. */
        assert(false);
    }
    else
    {
        QSPI_MasterEnableSlaveSelectStrobe(base, psConfig->bEnableStrobe);
    }

    /* Configure the Width of data */
    QSPI_SetTransactionDataSize(base, psConfig->eDataWidth);

    /* FIFO Configuration */
    QSPI_EnableFifo(base, psConfig->bEnableFIFO);
    if (psConfig->bEnableFIFO)
    {
        QSPI_SetFifoWatermarks(base, psConfig->eTxFIFOWatermark, psConfig->eRxFIFOWatermark);
    }

    /* Set delay between Data width */
    QSPI_MasterSetWaitDelay(base, psConfig->u16DelayBetweenFrameInCLK);

    QSPI_EnableStopModeHoldOff(base, psConfig->bEnableStopModeHoldOff);

    /* Enable interrupts if requested */
    QSPI_EnableInterrupts(base, psConfig->u8Interrupts);

    if (psConfig->bEnableModule)
    {
        QSPI_Enable(base, true);
    }
}

/*!
 * brief Set the qspi_master_config_t structure to default values.
 *
 * The purpose of this API is to get the configuration structure initialized for the QSPI_MasterInit.
 * Users may use the initialized structure unchanged in the QSPI_MasterInit or modify the structure
 * before calling the QSPI_MasterInit.
 * Example:
 * code
 *  qspi_master_config_t psConfig;
 *  QSPI_MasterGetDefaultConfig(&psConfig);
 * endcode
 * The default values are:
 * Example:
 * @code
 *  psConfig->baudRate               = 500000U;
 *  psConfig->dataWidth              = (uint16_t)kSPI_Data8Bits;
 *  psConfig->cpol                   = kQSPI_ClockPolarityActiveHigh;
 *  psConfig->cpha                   = kQSPI_ClockPhaseSecondEdge;
 *  psConfig->direction              = kQSPI_MsbFirst;
 *  psConfig->delayBetweenFrameInCLK = 1U;
 *  psConfig->wiredOrMode            = false;
 * @endcode
 *
 * param psConfig pointer to qspi_master_config_t structure.
 */
void QSPI_MasterGetDefaultConfig(qspi_master_config_t *psConfig, uint32_t u32ClockFreqHz)
{
    assert(NULL != psConfig);

    /* Initialize the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    /* Parameter provided by user */
    psConfig->u32ClockFrequencyHz = u32ClockFreqHz;

    /* Default configuration */
    psConfig->u32BaudRateBps            = 500000;
    psConfig->eDataWidth                = kQSPI_Data8Bits;
    psConfig->eClkPolarity              = kQSPI_ClockPolarityActiveRisingEdge;
    psConfig->eClkPhase                 = kQSPI_ClockPhaseSlaveSelectLowBetweenWords;
    psConfig->eShiftDirection           = kQSPI_MsbFirst;
    psConfig->u16DelayBetweenFrameInCLK = 1U;
    psConfig->bEnableWiredOrMode        = false;
    psConfig->bEnableModeFault          = false;
    psConfig->u8DmaEnableFlags          = 0U; /* Disable all DMA */
    psConfig->bEnableFIFO               = false;
    psConfig->bEnableStopModeHoldOff    = false;
    psConfig->u8Interrupts              = 0U;
    psConfig->bEnableModule             = false;
}

/*!
 * brief Initializes the QUEUEDSPI slave.
 *
 * param base QUEUEDSPI peripheral address.
 * param slaveConfig Pointer to the structure qspi_slave_config_t.
 */
void QSPI_SlaveInit(QSPI_Type *base, const qspi_slave_config_t *psConfig)
{
    assert(NULL != psConfig);

    uint16_t temp = 0;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable queued_spi clock */
    CLOCK_EnableClock(s_eQspiClocks[QSPI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Disable module before configuring. */
    QSPI_Enable(base, false);

    /* Set module as slave. */
    QSPI_SetMasterSlaveMode(base, kQSPI_Slave);

    /* Set CPHA, CPOL and date shift order. */
    QSPI_SetClockPolarity(base, psConfig->eClkPolarity);
    QSPI_SetClockPhase(base, psConfig->eClkPhase);
    QSPI_SetDataShiftOrder(base, psConfig->eShiftDirection);

    /* TODO Mode Fault Detect */
    QSPI_EnableModeFault(base, psConfig->bEnableModeFault);

    /* Set Wired-OR mode*/
    QSPI_EnableWiredORMode(base, psConfig->bEnableWiredOrMode);

    /* Set Data Width */
    QSPI_SetTransactionDataSize(base, psConfig->eDataWidth);

    /* Enable DMA */
    QSPI_EnableDMA(base, psConfig->u8DmaEnableFlags);

    /* Slave Select Signal Config */
    QSPI_SetSlaveSelectDirection(base, kQSPI_SlaveSelectDirectionInput);
    QSPI_EnableSlaveSelectOverride(base, psConfig->bEnableSlaveSelOverride);

    /* Set data width */
    QSPI_SetTransactionDataSize(base, psConfig->eDataWidth);

    /* FIFO Configuration */
    QSPI_EnableFifo(base, psConfig->bEnableFIFO);
    if (psConfig->bEnableFIFO)
    {
        QSPI_SetFifoWatermarks(base, psConfig->eTxFIFOWatermark, psConfig->eRxFIFOWatermark);
    }

    QSPI_EnableStopModeHoldOff(base, psConfig->bEnableStopModeHoldOff);

    /* Enable interrupts if requested */
    QSPI_EnableInterrupts(base, psConfig->u8Interrupts);

    if (psConfig->bEnableModule)
    {
        QSPI_Enable(base, true);
    }
}

/*!
 * brief Set the qspi_slave_config_t structure to default values.
 *
 * The purpose of this API is to get the configuration structure initialized for the QSPI_SlaveInit.
 * Users may use the initialized structure unchanged in the QSPI_SlaveInit or modify the structure
 * before calling the QSPI_SlaveInit.
 * Example:
 * code
 *  qspi_slave_config_t slaveConfig;
 *  QSPI_SlaveGetDefaultConfig(&slaveConfig);
 * endcode
 * The default values are:
 * Example:
 * code
 *  slaveConfig->dataWidth   = (uint16_t)kSPI_Data8Bits;
 *  slaveConfig->cpol        = kQSPI_ClockPolarityActiveHigh;
 *  slaveConfig->cpha        = kQSPI_ClockPhaseSecondEdge;
 *  slaveConfig->direction   = kQSPI_MsbFirst;
 *  slaveConfig->wiredOrMode = false;
 * endcode
 *
 * param slaveConfig Pointer to the qspi_slave_config_t structure.
 */
void QSPI_SlaveGetDefaultConfig(qspi_slave_config_t *psConfig)
{
    assert(NULL != psConfig);

    /* Initialize the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    /* User provided parameter */

    /* Default parameter */
    psConfig->eDataWidth              = kQSPI_Data8Bits;
    psConfig->eClkPolarity            = kQSPI_ClockPolarityActiveRisingEdge;
    psConfig->eClkPhase               = kQSPI_ClockPhaseSlaveSelectLowBetweenWords;
    psConfig->eShiftDirection         = kQSPI_MsbFirst;
    psConfig->bEnableWiredOrMode      = false;
    psConfig->u8DmaEnableFlags        = 0U; /* Disable TX/RX Dma */
    psConfig->bEnableSlaveSelOverride = false;
    psConfig->bEnableFIFO             = false;
    psConfig->bEnableStopModeHoldOff  = false;
    psConfig->u8Interrupts            = 0U;
    psConfig->bEnableModule           = false;
}

/*!
 * brief De-initialize the QUEUEDSPI peripheral.
 * param base QUEUEDSPI peripheral address.
 */
void QSPI_Deinit(QSPI_Type *base)
{
    /* Disable all interrupts. */
    QSPI_DisableInterrupts(base, (uint8_t)kQSPI_AllInterrupts);

