nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.c
    /* Disable DMA requests. */
    QSPI_DisableInterrupts(base, (uint8_t)kQSPI_DmaTx | (uint8_t)kQSPI_DmaTx);

    QSPI_Enable(base, false);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Disable queued_spi clock */
    CLOCK_DisableClock(s_eQspiClocks[QSPI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Set the QUEUEDSPI baud rate in bits-per-second.
 *
 * This function takes in the desired baud rate, calculates the nearest possible baud rate,
 * and returns the calculated baud rate in bits-per-second.
 *
 * param base QUEUEDSPI peripheral address.
 * param u32BaudRateBsp The desired baud rate in bits-per-second.
 * param u32SrcClockHz Module source input clock in Hertz.
 * return The actual calculated baud rate.
 */
uint32_t QSPI_MasterSetBaudRate(QSPI_Type *base, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz)
{
    /* Baudrate configuration is only supported for master, if slave mode is detected, return 0. */
    if (!QSPI_IsMaster(base))
    {
        return 0U;
    }

    uint8_t doubleDiv;
    bool div3;
    uint8_t div;
    uint16_t temp;

    uint8_t tempDiv, bestDiv;
    uint32_t prescaler = 1U;
    uint32_t realBaudrate, bestBaudrate;
    uint32_t diff, min_diff;

    min_diff = 0xFFFFFFFFU;
    /* Enter for loops, if min_diff == 0, then exit for loop. */
    for (tempDiv = 0U; tempDiv <= 14U; tempDiv++)
    {
        prescaler *= 2U;
        realBaudrate = u32SrcClockHz / prescaler;

        /* Calculate the baud rate difference. */
        diff = (u32BaudRateBps > realBaudrate) ? (u32BaudRateBps - realBaudrate) : (realBaudrate - u32BaudRateBps);
        if (diff < min_diff)
        {
            /* A better match is found. */
            min_diff     = diff;
            bestDiv      = tempDiv;
            bestBaudrate = realBaudrate;
        }
        if (0U == min_diff)
        {
            break;
        }
    }

    /* Calculate div, div3 and doubleDiv.
       The formula is bestDiv = div + 1U + doubleDiv if div3 is false, bestDiv = div + 9U + doubleDiv if div3 is true.
     */
    div = bestDiv - 1U;
    if (div > 8U)
    {
        div3      = true;
        div       = bestDiv - 9U;
        doubleDiv = 0U;
    }
    else if (div > 7U)
    {
        div3      = false;
        div       = bestDiv - 2U;
        doubleDiv = 1U;
    }
    else
    {
        div3      = false;
        doubleDiv = 0U;
    }

    /* Write the best div, div3 and doubelDiv. */
    temp        = base->SPSCR & ~QSPI_SPSCR_SPR_MASK;
    base->SPSCR = temp | QSPI_SPSCR_SPR((uint16_t)div);

    temp        = base->SPDSR & ~(QSPI_SPDSR_BD2X_MASK | QSPI_SPDSR_SPR3_MASK);
    base->SPDSR = temp | (QSPI_SPDSR_BD2X((uint16_t)doubleDiv) | QSPI_SPDSR_SPR3((uint16_t)div3));

    /* Return the actual calculated baud rate. */
    return bestBaudrate;
}

/*Transactional APIs -- Master*/

/*!
 * @brief Initialize the QUEUEDSPI master psHandle.
 *
 * This function initializes the QUEUEDSPI psHandle, which can be used for other QUEUEDSPI transactional APIs. Usually,
 * for a specified QUEUEDSPI instance, call this API once to get the initialized psHandle.
 *
 * @note If only use the QSPI_MasterTransferBlocking, this API is not necessary be called.
 *
 * @param base QUEUEDSPI peripheral base address.
 * @param psHandle QUEUEDSPI psHandle pointer to qspi_master_transfer_handle_t.
 * @param pfCallback QUEUEDSPI callback.
 * @param pUserData Callback function parameter.
 */
void QSPI_MasterTransferCreateHandle(QSPI_Type *base,
                                     qspi_master_transfer_handle_t *psHandle,
                                     qspi_master_transfer_callback_t pfCallback,
                                     void *pUserData)
{
    assert(NULL != psHandle);

    /* Zero the psHandle. */
    (void)memset(psHandle, 0, sizeof(*psHandle));

    s_psQspiHandles[QSPI_GetInstance(base)] = psHandle;

    /* Set irq psHandler. */
    s_pfQspiMasterIsr = QSPI_MasterTransferHandleIRQ;

    psHandle->base       = base;
    psHandle->pfCallback = pfCallback;
    psHandle->pUserData  = pUserData;
}

/*!
 * @brief Polling method of QUEUEDSPI master transfer.
 *
 * This function transfers data using a polling method for master. This is a blocking function,
 * which does not return until all transfers have been completed.
 *
 * @param base QUEUEDSPI peripheral base address.
 * @param psXfer Pointer to the qspi_transfer_t structure.
 * @return status of status_t.
 */
status_t QSPI_MasterTransferBlocking(QSPI_Type *base, qspi_transfer_t *psXfer)
{
    assert(NULL != psXfer);

    uint16_t wordToSend      = 0;
    uint16_t u16WordReceived = 0;

    uint8_t *txData = psXfer->pTxData;
    uint8_t *rxData = psXfer->pRxData;

    uint32_t u16RemainingSendByteCount    = (uint32_t)psXfer->u16DataSize;
    uint32_t u16RemainingReceiveByteCount = (uint32_t)psXfer->u16DataSize;
    /* Calculate the data width. */
    qspi_data_width_t dataWidth = (uint8_t)((base->SPDSR & QSPI_SPDSR_DS_MASK) >> QSPI_SPDSR_DS_SHIFT);
    uint8_t dummyData           = QSPI_GetDummyData(base);

    /* Parameter Check */
    if ((psXfer == NULL) || ((psXfer->pTxData == NULL) && (psXfer->pRxData == NULL)) || (psXfer->u16DataSize == 0U))
    {
        return (status_t)kStatus_InvalidArgument;
    }

    /* Disable all interrupts in blocking method. */
    QSPI_DisableInterrupts(base, (uint8_t)kQSPI_AllInterrupts);

    /* Read out any possible data in the RX FIFO. */
    QSPI_EmptyRxFifo(base);

    /* Enable TX and RX FIFO. */
    QSPI_EnableFifo(base, true);

    /* Enable QSPI Module */
    QSPI_Enable(base, true);

    /* Check transfer flags. */
    if ((psXfer->u8ConfigFlags & (uint8_t)kQSPI_MasterPCSContinous) != 0U)
    {
        /* Before changing the SPDSR register, disable the module. */
        QSPI_Enable(base, false);

        uint16_t temp = base->SPDSR & ~(QSPI_SPDSR_SSB_STRB_MASK | QSPI_SPDSR_SSB_AUTO_MASK);

        bool PCSmanual;
        /* If currently the PCS is active or the PCS should stay active after current transfer, then the PCS signal must
         * be manually changed. */
        if (((base->SPDSR & QSPI_SPDSR_SSB_DATA_MASK) == 0U) ||
            ((psXfer->u8ConfigFlags & (uint8_t)kQSPI_MasterActiveAfterTransfer) != 0U))
        {
            PCSmanual = true;
        }

        temp |= (QSPI_SPDSR_SSB_STRB(0U) | QSPI_SPDSR_SSB_AUTO(!PCSmanual));

        base->SPDSR = temp;

        /* Re-enable the module to have the new value take effect. */
        QSPI_Enable(base, true);
    }

    /* If SSB_AUTO are not set, it means the PCS signal is in manual state. */
    /* Assert the PSC signal if PCS signal is current not in active state. */
    if (((base->SPDSR & QSPI_SPDSR_SSB_AUTO_MASK) == 0U) && ((base->SPDSR & QSPI_SPDSR_SSB_DATA_MASK) != 0U))
    {
        QSPI_TogglePCS(base);
    }

