nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.c
    /* Calculate dummy data to send. */
    if (txData == NULL)
    {
        wordToSend = (uint16_t)dummyData | ((uint16_t)dummyData << 8U);
    }

    if (dataWidth <= kQSPI_Data8Bits)
    {
        while ((u16RemainingSendByteCount > 0U) || (u16RemainingReceiveByteCount > 0U))
        {
            /* Push data to transmit data register if it is not full. */
            while ((4U != QSPI_GetTxFIFOCount(base)) && (u16RemainingSendByteCount != 0U))
            {
                if (txData != NULL)
                {
                    base->SPDTR = (uint16_t)(*txData);
                    txData++;
                }
                else
                {
                    base->SPDTR = wordToSend;
                }
                u16RemainingSendByteCount--;
            }

            /* Read data out of receive data register if it is not empty. */
            while ((0U != QSPI_GetRxFIFOCount(base)) && (u16RemainingReceiveByteCount != 0U))
            {
                if (rxData != NULL)
                {
                    *(rxData) = (uint8_t)QSPI_ReadData(base);
                    rxData++;
                }
                else
                {
                    (void)QSPI_ReadData(base);
                }
                u16RemainingReceiveByteCount--;
            }
        }
    }
    else
    {
        while ((u16RemainingSendByteCount > 0U) || (u16RemainingReceiveByteCount > 0U))
        {
            /* Push data to transmit data register if it is not full. */
            while ((4U != QSPI_GetTxFIFOCount(base)) && (u16RemainingSendByteCount != 0U))
            {
                if (u16RemainingSendByteCount > 1U)
                {
                    if (txData != NULL)
                    {
                        wordToSend = (uint16_t) * (txData);
                        ++txData;
                        wordToSend |= (uint16_t)(*(txData)) << 8U;
                        ++txData;
                    }
                    u16RemainingSendByteCount -= 2U;
                }
                else
                {
                    if (txData != NULL)
                    {
                        wordToSend = (uint16_t) * (txData);
                        ++txData;
                    }
                    u16RemainingSendByteCount--;
                }
                QSPI_WriteData(base, wordToSend);
            }

            /* Read data out of receive data register if it is not empty. */
            while ((0U != QSPI_GetRxFIFOCount(base)) && (u16RemainingReceiveByteCount != 0U))
            {
                u16WordReceived = QSPI_ReadData(base);

                if (u16RemainingReceiveByteCount > 1U)
                {
                    if (rxData != NULL)
                    {
                        *(rxData) = (uint8_t)u16WordReceived;
                        ++rxData;
                        *(rxData) = (uint8_t)(u16WordReceived >> 8U);
                        ++rxData;
                    }
                    u16RemainingReceiveByteCount -= 2U;
                }
                else
                {
                    if (rxData != NULL)
                    {
                        *(rxData) = (uint8_t)u16WordReceived;
                        ++rxData;
                    }
                    u16RemainingReceiveByteCount--;
                }
            }
        }
    }

    /* Wait until all data are transfered out to bus. */
    while (0U != QSPI_GetTxFIFOCount(base))
    {
    }

    /* If SSB_AUTO are not set, it means the PCS signal is in manual state. */
    /* De-assert PSC signal if kQSPI_MasterActiveAfterTransfer is not set. */
    if (((base->SPDSR & QSPI_SPDSR_SSB_AUTO_MASK) == 0U) &&
        ((psXfer->u8ConfigFlags & (uint8_t)kQSPI_MasterActiveAfterTransfer) == 0U))
    {
        QSPI_TogglePCS(base);
    }

    return kStatus_Success;
}

/*!
 * brief Interrupt method of QUEUEDSPI master transfer.
 *
 * This function transfers data using interrupts for master. This is a non-blocking function,
 * which returns right away. When all data is transferred, the callback function is called.
 *
 * param base QUEUEDSPI peripheral base address.
 * param psHandle Pointer to the qspi_master_transfer_handle_t structure which stores the transfer state.
 * param psXfer Pointer to the qspi_transfer_t structure.
 * return status of status_t.
 */
status_t QSPI_MasterTransferNonBlocking(qspi_master_transfer_handle_t *psHandle, qspi_transfer_t *psXfer)
{
    assert(NULL != psHandle);
    assert(NULL != psXfer);
    assert((psXfer->pRxData != NULL) || (psXfer->pTxData != NULL));

    QSPI_Type *base = psHandle->base;

    /* If the transfer count is zero, then return immediately.*/
    if (psXfer->u16DataSize == 0U)
    {
        return kStatus_InvalidArgument;
    }

    /* Check that we're not busy. */
    if (psHandle->u8State == (uint8_t)kQSPI_Busy)
    {
        return kStatus_QSPI_Busy;
    }

    /* Set transfer state to busy. */
    psHandle->u8State = (uint8_t)kQSPI_Busy;

    /* Disable all interrupts. */
    QSPI_DisableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable | (uint16_t)kQSPI_RxInterruptEnable |
                                     (uint16_t)kQSPI_RxOverFlowInterruptEnable);
    /* Read out any possible data in the RX FIFO. */
    QSPI_EmptyRxFifo(base);
    /* Enable TX and RX FIFO. */
    QSPI_EnableFifo(base, true);

    /* Prepare transfer. */
    psHandle->eDataWidth = (qspi_data_width_t)((base->SPDSR & QSPI_SPDSR_DS_MASK) >> QSPI_SPDSR_DS_SHIFT);

    psHandle->bIsPcsActiveAfterTransfer = ((psXfer->u8ConfigFlags & (uint8_t)kQSPI_MasterActiveAfterTransfer) != 0U);

    psHandle->pu8TxData                    = psXfer->pTxData;
    psHandle->pu8RxData                    = psXfer->pRxData;
    psHandle->u16RemainingSendByteCount    = psXfer->u16DataSize;
    psHandle->u16RemainingReceiveByteCount = psXfer->u16DataSize;
    psHandle->u16TotalByteCount            = psXfer->u16DataSize;

    /* Set proper warter marks. */
    QSPI_SetFifoWatermarks(base, kQSPI_TxFifoWatermarkThreeWord, kQSPI_RxFifoWatermarkOneWord);

