nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.c
    /* Check transfer flags. */
    if ((psXfer->u8ConfigFlags & (uint8_t)kQSPI_MasterPCSContinous) != 0U)
    {
        /* Before changing the SPDSR register, disable the module. */
        QSPI_Enable(base, false);

        uint16_t temp = base->SPDSR & ~(QSPI_SPDSR_SSB_STRB_MASK | QSPI_SPDSR_SSB_AUTO_MASK);

        bool PCSmanual;
        /* If currently the PCS is active or the PCS should stay active after current transfer, then the PCS signal must
         * be manully changed. */
        if (((base->SPDSR & QSPI_SPDSR_SSB_DATA_MASK) == 0U) ||
            ((psXfer->u8ConfigFlags & (uint8_t)kQSPI_MasterActiveAfterTransfer) != 0U))
        {
            PCSmanual = true;
        }

        temp |= (QSPI_SPDSR_SSB_STRB(0U) | QSPI_SPDSR_SSB_AUTO((uint16_t)!PCSmanual));

        base->SPDSR = temp;

        /* Re-enable the module to have the new value take effect. */
        QSPI_Enable(base, true);
    }

    /* If SSB_AUTO are not set, it means the PCS signal is in manual state. */
    /* Assert the PSC signal if PCS signal is current not in active state. */
    if (((base->SPDSR & QSPI_SPDSR_SSB_AUTO_MASK) == 0U) && ((base->SPDSR & QSPI_SPDSR_SSB_DATA_MASK) != 0U))
    {
        QSPI_TogglePCS(base);
    }

    /* Since SPI is a synchronous interface, we only need to enable the RX interrupt if there is RX data. */
    if (psHandle->pu8RxData != NULL)
    {
        QSPI_EnableInterrupts(base, (uint16_t)kQSPI_RxInterruptEnable);
        (void)EnableIRQ(s_eQspiRXIRQs[QSPI_GetInstance(base)]);
    }
    else
    {
        QSPI_EnableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable);
        (void)EnableIRQ(s_eQspiTXIRQs[QSPI_GetInstance(base)]);
    }

    QSPI_Enable(base, true);

    /* Fill up the TX FIFO to trigger the transfer. */
    QSPI_TransferFillUpTxFifo(base, psHandle);

    return kStatus_Success;
}

/*!
 * brief Get the master transfer count.
 *
 * param base QUEUEDSPI peripheral base address.
 * param psHandle Pointer to the qspi_master_transfer_handle_t structure which stores the transfer state.
 * param pu16Count The number of bytes transferred by using the non-blocking transaction.
 * return status of status_t.
 */
status_t QSPI_MasterTransferGetCount(qspi_master_transfer_handle_t *psHandle, uint16_t *pu16Count)
{
    assert(NULL != psHandle);

    if (NULL == pu16Count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (psHandle->u8State != (uint8_t)kQSPI_Busy)
    {
        *pu16Count = 0;
        return kStatus_NoTransferInProgress;
    }

    if (psHandle->pu8RxData != NULL)
    {
        *pu16Count = psHandle->u16TotalByteCount - psHandle->u16RemainingReceiveByteCount;
    }
    else
    {
        *pu16Count = psHandle->u16TotalByteCount - psHandle->u16RemainingSendByteCount;
    }

    return kStatus_Success;
}

/*!
 * brief Abort a transfer that uses interrupts for master.
 *
 * param base QUEUEDSPI peripheral base address.
 * param psHandle Pointer to the qspi_master_transfer_handle_t structure which stores the transfer state.
 */
void QSPI_MasterTransferAbort(qspi_master_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    QSPI_Type *base = psHandle->base;

    /* Disable interrupt requests. */
    QSPI_DisableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable | (uint16_t)kQSPI_RxInterruptEnable |
                                     (uint16_t)kQSPI_RxOverFlowInterruptEnable);

    /* De-assert the PSC signal if PCS signal is current in active state and the PCS signal is in manual mode. */
    if (((base->SPDSR & QSPI_SPDSR_SSB_DATA_MASK) == 0U) && ((base->SPDSR & QSPI_SPDSR_SSB_AUTO_MASK) == 0U))
    {
        QSPI_TogglePCS(base);
    }

    psHandle->u8State                      = (uint8_t)kQSPI_Idle;
    psHandle->u16RemainingSendByteCount    = 0U;
    psHandle->u16RemainingReceiveByteCount = 0U;
}

/*!
 * brief QUEUEDSPI Master IRQ psHandler function.
 *
 * This function processes the QUEUEDSPI transmit and receive IRQ.
 *
 * param base QUEUEDSPI peripheral base address.
 * param psHandle Pointer to the qspi_master_transfer_handle_t structure which stores the transfer state.
 */
void QSPI_MasterTransferHandleIRQ(qspi_master_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    QSPI_Type *base = psHandle->base;

    /* Check receive register if there are remaining bytes to read. */
    if (0U != (psHandle->u16RemainingReceiveByteCount))
    {
        QSPI_TransferReadoutRxFifo(base, psHandle);
    }

    /* Write transmit register. We always have to send a word in order to keep the transfer
     * moving. If the caller didn't provide a send buffer, just send dummydata.
     */
    if (0U != (psHandle->u16RemainingSendByteCount))
    {
        QSPI_TransferFillUpTxFifo(base, psHandle);
    }

    /* Check if we're done with this transfer. */
    size_t tempRemainingSendByteCount    = psHandle->u16RemainingSendByteCount;
    size_t tempRemainingReceiveByteCount = psHandle->u16RemainingReceiveByteCount;
    if ((tempRemainingSendByteCount == 0U) && (tempRemainingReceiveByteCount == 0U))
    {
        /* Complete the transfer and disable the interrupts. */
        QSPI_MasterTransferComplete(base, psHandle);
    }
}

static void QSPI_TransferReadoutRxFifo(QSPI_Type *base, qspi_master_transfer_handle_t *psHandle)
{
    uint16_t u16WordReceived;

    /* If bits-per-frame is greater than one byte. */
    if (psHandle->eDataWidth > kQSPI_Data8Bits)
    {
        while ((0U != QSPI_GetRxFIFOCount(base)) && (psHandle->u16RemainingReceiveByteCount != 0U))
        {
            u16WordReceived = QSPI_ReadData(base);
            if (psHandle->u16RemainingReceiveByteCount == 1U)
            {
                /* Store read bytes into rx buffer only if a buffer pointer is provided. */

                /* For the last word received, if there is an extra byte due to the odd transfer
                 * byte count, only save the last byte and discard the upper byte. */
                if (NULL != psHandle->pu8RxData)
                {
                    *psHandle->pu8RxData = (uint8_t)u16WordReceived;
                }
                --psHandle->u16RemainingReceiveByteCount;
            }
            else
            {
                /* Store read bytes into rx buffer only if a buffer pointer is provided. */
                if (NULL != psHandle->pu8RxData)
                {
                    *psHandle->pu8RxData = (uint8_t)u16WordReceived;
                    ++psHandle->pu8RxData;
                    *psHandle->pu8RxData = (uint8_t)(u16WordReceived >> 8U);
                    ++psHandle->pu8RxData;
                }
                psHandle->u16RemainingReceiveByteCount -= 2U;
            }
        } /* End of RX FIFO drain while loop. */
    }
    else
    {
        while ((0U != QSPI_GetRxFIFOCount(base)) && (psHandle->u16RemainingReceiveByteCount != 0U))
        {
            u16WordReceived = QSPI_ReadData(base);

            /* Store read bytes into rx buffer only if a buffer pointer is provided. */
            if (NULL != psHandle->pu8RxData)
            {
                *psHandle->pu8RxData = (uint8_t)u16WordReceived;
                ++psHandle->pu8RxData;
            }
            --psHandle->u16RemainingReceiveByteCount;
        } /* End of RX FIFO drain while loop. */
    }
}

static void QSPI_TransferFillUpTxFifo(QSPI_Type *base, qspi_master_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    uint16_t wordToSend                 = 0U;
    uint8_t dummyData                   = QSPI_GetDummyData(base);
    size_t tmpRemainingSendByteCount    = psHandle->u16RemainingSendByteCount;
    size_t tmpRemainingReceiveByteCount = psHandle->u16RemainingReceiveByteCount;
    size_t fifoSize                     = 4U;

    if (NULL == psHandle->pu8TxData)
    {
        wordToSend = (uint16_t)dummyData | (uint16_t)dummyData << 8U;
    }
    /* If dataWidth is greater than one byte. */
    if (psHandle->eDataWidth > kQSPI_Data8Bits)
    {
        /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth,
         * unless there is no rxData.
         */
        while (((((tmpRemainingReceiveByteCount - tmpRemainingSendByteCount) / 2U) < fifoSize) ||
                (psHandle->pu8RxData == NULL)) &&
               (tmpRemainingSendByteCount != 0U))
        {
            if (psHandle->u16RemainingSendByteCount == 1U)
            {
                if (NULL != psHandle->pu8TxData)
                {
                    wordToSend = (uint16_t) * (psHandle->pu8TxData);
                }
                psHandle->u16RemainingSendByteCount = 0;
            }
            else
            {
                if (NULL != psHandle->pu8TxData)
                {
                    wordToSend = (uint16_t) * (psHandle->pu8TxData);
                    ++psHandle->pu8TxData;
                    wordToSend |= (uint16_t)(*(psHandle->pu8TxData)) << 8U;
                    ++psHandle->pu8TxData;
                }
                psHandle->u16RemainingSendByteCount -= 2U;
            }
            QSPI_WriteData(base, wordToSend);

            /* Update the temp data. */
            tmpRemainingSendByteCount    = psHandle->u16RemainingSendByteCount;
            tmpRemainingReceiveByteCount = psHandle->u16RemainingReceiveByteCount;
        } /* End of TX FIFO fill while loop. */
    }
    else
    {
        /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth,
         * unless there is no rxData. */
        while ((((tmpRemainingReceiveByteCount - tmpRemainingSendByteCount) < fifoSize) ||
                (psHandle->pu8RxData == NULL)) &&
               (tmpRemainingSendByteCount != 0U))
        {
            if (NULL != psHandle->pu8TxData)
            {
                wordToSend = (uint16_t) * (psHandle->pu8TxData);
                ++psHandle->pu8TxData;
            }
            --psHandle->u16RemainingSendByteCount;

            QSPI_WriteData(base, wordToSend);
            /* Update the temp data. */
            tmpRemainingReceiveByteCount = psHandle->u16RemainingReceiveByteCount;
            tmpRemainingSendByteCount    = psHandle->u16RemainingSendByteCount;
        }
    }
}

static void QSPI_MasterTransferComplete(QSPI_Type *base, qspi_master_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    psHandle->u8State   = (uint8_t)kQSPI_Idle;
    psHandle->pu8TxData = NULL;
    psHandle->pu8RxData = NULL;

    /* Disable interrupt requests. */
    QSPI_DisableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable | (uint16_t)kQSPI_RxInterruptEnable |
                                     (uint16_t)kQSPI_RxOverFlowInterruptEnable);

    /* If SSB_AUTO are not set, it means the PCS signal is in manual state. */
    /* De-assert the PSC signal if PCS signal is current in active state and the PCS should not stay active after
     * transfer. */
    if (((base->SPDSR & QSPI_SPDSR_SSB_AUTO_MASK) == 0U) && ((base->SPDSR & QSPI_SPDSR_SSB_DATA_MASK) == 0U) &&
        (!psHandle->bIsPcsActiveAfterTransfer))
    {
        QSPI_TogglePCS(base);
    }

