nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.c
    if (NULL != psHandle->pfCallback)
    {
        psHandle->pfCallback(psHandle, kStatus_Success, psHandle->pUserData);
    }
}

/*Transactional APIs -- Slave*/

/*!
 * @brief Initialize the QUEUEDSPI slave handle.
 *
 * This function initializes the QUEUEDSPI handle, which can be used for other QUEUEDSPI transactional APIs. Usually,
 * for a specified QUEUEDSPI instance, call this API once to get the initialized handle.
 *
 * @param base QUEUEDSPI peripheral base address.
 * @param psHandle QUEUEDSPI handle pointer to the qspi_slave_transfer_handle_t.
 * @param pfCallback QUEUEDSPI callback.
 * @param pUserData Callback function parameter.
 */
void QSPI_SlaveTransferCreateHandle(QSPI_Type *base,
                                    qspi_slave_transfer_handle_t *psHandle,
                                    qspi_slave_transfer_callback_t pfCallback,
                                    void *pUserData)
{
    assert(NULL != psHandle);

    /* Zero the psHandle. */
    (void)memset(psHandle, 0, sizeof(*psHandle));

    s_psQspiHandles[QSPI_GetInstance(base)] = psHandle;

    /* Set IRQ psHandler. */
    s_pfQspiSlaveIsr = QSPI_SlaveTransferHandleIRQ;

    psHandle->base       = base;
    psHandle->pfCallback = pfCallback;
    psHandle->pUserData  = pUserData;
}

/*!
 * brief Interrupt method of QUEUEDSPI slave transfer.
 *
 * This function transfers data using interrupts for slave. This is a non-blocking function,
 * which returns right away. When all data is transferred, the callback function is called.
 *
 * param psHandle Pointer to the qspi_slave_transfer_handle_t structure which stores the transfer state.
 * param psXfer Pointer to the qspi_transfer_t structure.
 * return status of status_t.
 */
status_t QSPI_SlaveTransferNonBlocking(qspi_slave_transfer_handle_t *psHandle, qspi_transfer_t *psXfer)
{
    assert(NULL != psHandle);
    assert(NULL != psXfer);
    assert((psXfer->pRxData != NULL) || (psXfer->pTxData != NULL));

    QSPI_Type *base = psHandle->base;

    /* If the transfer count is zero, then return immediately. */
    if (psXfer->u16DataSize == 0U)
    {
        return kStatus_InvalidArgument;
    }

    /* Check that we're not busy. */
    if (psHandle->u8State == (uint8_t)kQSPI_Busy)
    {
        return kStatus_QSPI_Busy;
    }

    /* Set transfer state to busy. */
    psHandle->u8State = (uint8_t)kQSPI_Busy;

    /* Disable all interrupts. */
    QSPI_DisableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable | (uint16_t)kQSPI_RxInterruptEnable |
                                     (uint16_t)kQSPI_RxOverFlowInterruptEnable);
    /* Read out any possible data in the RX FIFO */
    QSPI_EmptyRxFifo(base);
    /* Enable TX and RX FIFO. */
    QSPI_EnableFifo(base, true);

    /* Prepare transfer. */
    psHandle->eDataWidth = (qspi_data_width_t)((base->SPDSR & QSPI_SPDSR_DS_MASK) >> QSPI_SPDSR_DS_SHIFT);

    psHandle->pu8TxData                    = psXfer->pTxData;
    psHandle->pu8RxData                    = psXfer->pRxData;
    psHandle->u16RemainingSendByteCount    = psXfer->u16DataSize;
    psHandle->u16RemainingReceiveByteCount = psXfer->u16DataSize;
    psHandle->u16TotalByteCount            = psXfer->u16DataSize;

    /* Set proper warter marks. */
    QSPI_SetFifoWatermarks(base, kQSPI_TxFifoWatermarkThreeWord, kQSPI_RxFifoWatermarkOneWord);

    /* Enable the IRQ for QUEUEDSPI peripheral. */
    QSPI_EnableInterrupts(base, (uint16_t)kQSPI_RxInterruptEnable);
    (void)EnableIRQ(s_eQspiRXIRQs[QSPI_GetInstance(base)]);
    if (psHandle->pu8RxData != NULL)
    {
        QSPI_EnableInterrupts(base, (uint16_t)kQSPI_RxOverFlowInterruptEnable);
    }
    if (psHandle->pu8TxData != NULL)
    {
        QSPI_EnableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable);
        (void)EnableIRQ(s_eQspiTXIRQs[QSPI_GetInstance(base)]);
    }

    /* Ensure the QSPI is enabled before Fill up FIFO */
    QSPI_Enable(base, true);

    /* Fill up the TX FIFO to trigger the transfer. */
    QSPI_TransferFillUpTxFifo(base, psHandle);

    return kStatus_Success;
}

/*!
 * @brief Get the slave transfer count already transmitted/received.
 *
 * @param base QUEUEDSPI peripheral base address.
 * @param psHandle Pointer to the qspi_slave_transfer_handle_t structure which stores the transfer state.
 * @param pu16Count The number of bytes transferred by using the non-blocking transaction.
 * @return status of status_t.
 */
status_t QSPI_SlaveTransferGetCount(qspi_slave_transfer_handle_t *psHandle, uint16_t *pu16Count)
{
    assert(NULL != psHandle);

    if (NULL == pu16Count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (psHandle->u8State != (uint8_t)kQSPI_Busy)
    {
        *pu16Count = 0;
        return kStatus_NoTransferInProgress;
    }

    if (psHandle->pu8RxData != NULL)
    {
        *pu16Count = psHandle->u16TotalByteCount - psHandle->u16RemainingReceiveByteCount;
    }
    else
    {
        *pu16Count = psHandle->u16TotalByteCount - psHandle->u16RemainingSendByteCount;
    }

    return kStatus_Success;
}

static void QSPI_SlaveTransferComplete(QSPI_Type *base, qspi_slave_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    status_t eStatus = kStatus_Success;

    /* Disable interrupt requests. */
    QSPI_DisableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable | (uint16_t)kQSPI_RxInterruptEnable |
                                     (uint16_t)kQSPI_RxOverFlowInterruptEnable);

    /* The transfer is complete. */
    psHandle->pu8TxData                    = NULL;
    psHandle->pu8RxData                    = NULL;
    psHandle->u16RemainingReceiveByteCount = 0U;
    psHandle->u16RemainingSendByteCount    = 0U;

    status_t statuslocation;
    if (psHandle->u8State == (uint8_t)kQSPI_Error)
    {
        eStatus = kStatus_QSPI_Error;
    }
    else
    {
        eStatus = kStatus_Success;
    }

    psHandle->u8State = (uint8_t)kQSPI_Idle;

    if (NULL != psHandle->pfCallback)
    {
        psHandle->pfCallback(psHandle, eStatus, psHandle->pUserData);
    }
}

/*!
 * brief Abort a transfer that uses interrupts for slave.
 *
 * param base QUEUEDSPI peripheral base address.
 * param psHandle Pointer to the qspi_slave_transfer_handle_t structure which stores the transfer state.
 */
void QSPI_SlaveTransferAbort(qspi_slave_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    QSPI_Type *base = psHandle->base;

    /* Disable interrupt requests. */
    QSPI_DisableInterrupts(base, (uint16_t)kQSPI_TxInterruptEnable | (uint16_t)kQSPI_RxInterruptEnable |
                                     (uint16_t)kQSPI_RxOverFlowInterruptEnable);

    psHandle->u8State                      = (uint8_t)kQSPI_Idle;
    psHandle->u16RemainingSendByteCount    = 0U;
    psHandle->u16RemainingReceiveByteCount = 0U;
}

/*!
 * brief QUEUEDSPI slave IRQ psHandler function.
 *
 * This function processes the QUEUEDSPI transmit and receive IRQ.
 *
 * param base QUEUEDSPI peripheral base address.
 * param psHandle Pointer to the qspi_slave_transfer_handle_t structure which stores the transfer state.
 */
void QSPI_SlaveTransferHandleIRQ(qspi_slave_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    QSPI_Type *base = psHandle->base;

    /* Check receive register if there are remaining bytes to be read. */
    if (0U != (psHandle->u16RemainingReceiveByteCount))
    {
        QSPI_TransferReadoutRxFifo(base, psHandle);
    }

    /* Write transmit register. If the caller doesn't provide a send buffer, just send dummydata. */
    if (0U != (psHandle->u16RemainingSendByteCount))
    {
        QSPI_TransferFillUpTxFifo(base, psHandle);
    }

    /* Check if transfer complete or error occured. */
    size_t tempRemainingSendByteCount    = psHandle->u16RemainingSendByteCount;
    size_t tempRemainingReceiveByteCount = psHandle->u16RemainingReceiveByteCount;
    if ((psHandle->u8State == (uint8_t)kQSPI_Error) ||
        ((tempRemainingSendByteCount == 0U) && (tempRemainingReceiveByteCount == 0U)))
    {
        QSPI_SlaveTransferComplete(base, psHandle);
        return;
    }

    /* Catch RX fifo overflow error, only if RX overflow interrupt is enabled. */
    if (0U != (QSPI_GetStatusFlags(base) & (uint16_t)kQSPI_RxOverflowFlag))
    {
        /* Change state to error if receive data is not NULL. */
        if (NULL != psHandle->pu8RxData)
        {
            psHandle->u8State = (uint8_t)kQSPI_Error;
        }
    }
}

static void QSPI_CommonIRQHandler(QSPI_Type *base, void *param)
{
    if (QSPI_IsMaster(base))
    {
        s_pfQspiMasterIsr((qspi_master_transfer_handle_t *)param);
    }
    else
    {
        s_pfQspiSlaveIsr((qspi_slave_transfer_handle_t *)param);
    }
/* Added for ARM errata 838869, affects Cortex-M4, Cortex-M4F. */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}

#if defined(QSPI0)
void QSPI0_XMIT_DriverIRQHandler(void)
{
    assert(s_psQspiHandles[0]);
    QSPI_CommonIRQHandler(QSPI0, s_psQspiHandles[0]);
}
void QSPI0_RCV_DriverIRQHandler(void)
{
    assert(s_psQspiHandles[0]);
    QSPI_CommonIRQHandler(QSPI0, s_psQspiHandles[0]);
}
#endif

#if defined(QSPI1)
void QSPI1_XMIT_DriverIRQHandler(void)
{
    assert(s_psQspiHandles[1]);
    QSPI_CommonIRQHandler(QSPI1, s_psQspiHandles[1]);
}
void QSPI1_RCV_DriverIRQHandler(void)
{
    assert(s_psQspiHandles[1]);
    QSPI_CommonIRQHandler(QSPI1, s_psQspiHandles[1]);
}
#endif
